src/qmckl_context.org
#+TITLE: Context
#+SETUPFILE: ../docs/theme.setup


  The context variable is a handle for the state of the library,
  and is stored in a data structure which can't be seen outside of
  the library.  To simplify compatibility with other languages, the
  pointer to the internal data structure is converted into a 64-bit
  signed integer, defined in the ~qmckl_context~ type.
  A value of ~QMCKL_NULL_CONTEXT~ for the context is equivalent to a
  ~NULL~ pointer.

   #+begin_src c :comments org :tangle (eval h)
typedef int64_t qmckl_context ;
#define QMCKL_NULL_CONTEXT (qmckl_context) 0
   #+end_src

   #+begin_src f90 :comments org :tangle (eval fh) :exports none
      integer*8, parameter :: QMCKL_NULL_CONTEXT = 0
   #+end_src
   
* Headers                                                          :noexport:

  #+NAME: filename
  #+begin_src elisp tangle: no 
(file-name-nondirectory (substring buffer-file-name 0 -4))
  #+end_src


  #+begin_src c :tangle (eval c_test) :noweb yes
#include "qmckl.h"
#include "munit.h"
MunitResult test_<<filename()>>() {
  #+end_src

  #+begin_src c :tangle (eval h_private)
#ifndef __QMCKL_CONTEXT__
#define __QMCKL_CONTEXT__

#include <stdint.h>
#include <pthread.h>
#include "qmckl_error.h"

  #+end_src

  #+begin_src c :tangle (eval c) 
#include <stdint.h>
#include <assert.h>
#include <math.h>
#include <stdlib.h>
#include <string.h>

#include "qmckl_error.h"
#include "qmckl_context.h"
#include "qmckl_context_private.h"
#include "qmckl_memory.h"

#include <stdio.h>
  #+end_src

* Context handling

  The context appears as an immutable data structure: modifying a
  context returns a new context with the modifications.  Therefore, it
  is necessary to store a pointer to the old version of context so
  that it can be freed when necessary.
  Note that we also provide a possibility to mutate the context, but
  this should be done with caution, only when it is justified.

  By convention, in this file ~context~ is a ~qmckl_context~ variable
  and ~ctx~ is a ~qmckl_context_struct*~ pointer.

** Data structure
   
   The main data structure contains pointers to other data structures,
   containing the data specific to each given domain, such that the
   modified contexts don't need to duplicate the data but only the
   pointers.
  
   #+NAME: qmckl_context_struct
   #+begin_src c :comments org :tangle none :noweb yes
typedef struct qmckl_context_struct {

  /* Pointer to the previous context, before modification */
  struct qmckl_context_struct * prev;

  /* Molecular system */
  qmckl_ao_basis_struct    * ao_basis;

  /* To be implemented:
  qmckl_nucleus_struct     * nucleus;
  qmckl_electron_struct    * electron;
  qmckl_mo_struct          * mo;
  qmckl_determinant_struct * det;
  ,*/

  /* Numerical precision */
  qmckl_precision_struct   * fp;

  /* Error handling */
  qmckl_error_struct       * error;

  /* Memory allocation */
  qmckl_memory_struct      * alloc;

  /* Thread lock */
  int                        lock_count;
  pthread_mutex_t            mutex;

  /* Validity checking */
  uint32_t                   tag;

} qmckl_context_struct;
   #+end_src


   #+begin_src c :comments org :tangle (eval h_private) :noweb yes :exports none
<<qmckl_error_struct>>

<<qmckl_memory_struct>>

<<qmckl_precision_struct>>

<<qmckl_ao_basis_struct>>

<<qmckl_context_struct>>
   #+end_src

   A tag is used internally to check if the memory domain pointed
   by a pointer is a valid context. This allows to check that even if
   the pointer associated with a context is non-null, we can still
   verify that it points to the expected data structure.

   #+begin_src c :comments org :tangle (eval h_private) :noweb yes
#define VALID_TAG   0xBEEFFACE
#define INVALID_TAG 0xDEADBEEF
   #+end_src

   The ~qmckl_context_check~ function checks if the domain pointed by
   the pointer is a valid context. It returns the input ~qmckl_context~
   if the context is valid, ~QMCKL_NULL_CONTEXT~ otherwise.

   #+begin_src c :comments org :tangle (eval h) :noexport
qmckl_context qmckl_context_check(const qmckl_context context) ;
   #+end_src

   #+begin_src c :tangle (eval c)
qmckl_context qmckl_context_check(const qmckl_context context) {

  if (context == QMCKL_NULL_CONTEXT)
    return QMCKL_NULL_CONTEXT;

  const qmckl_context_struct* ctx = (qmckl_context_struct*) context;

  /* Try to access memory */
  if (ctx->tag != VALID_TAG) {
      return QMCKL_NULL_CONTEXT;
  }

  return context;
}
   #+end_src

