qmckl_context.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-20 Sat 15:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Context</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="TREX CoE" />
<link rel="stylesheet" title="Standard" href="qmckl.css" type="text/css" />


</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Context</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org95a04bd">1. Context handling</a>
<ul>
<li><a href="#orga7ca711">1.1. Data structure</a></li>
<li><a href="#org9f6d849">1.2. Creation</a></li>
<li><a href="#orgb851511">1.3. Access to the previous context</a></li>
<li><a href="#orgb4cd544">1.4. Locking</a></li>
<li><a href="#orgc4c8967">1.5. Copy</a></li>
<li><a href="#org9b95ba0">1.6. Destroy</a></li>
</ul>
</li>
<li><a href="#org0f2231c">2. Memory allocation handling</a>
<ul>
<li><a href="#org4b12848">2.1. Data structure</a></li>
<li><a href="#orgb628973">2.2. Append memory</a></li>
<li><a href="#org2d326c6">2.3. Remove memory</a></li>
</ul>
</li>
<li><a href="#orgc23251d">3. Error handling</a>
<ul>
<li><a href="#orgda9e324">3.1. Data structure</a></li>
<li><a href="#org1efeff8">3.2. Updating errors</a></li>
</ul>
</li>
<li><a href="#orga04bd35">4. Control of the numerical precision</a>
<ul>
<li><a href="#org8114fc0">4.1. Precision</a></li>
<li><a href="#orgfe3627f">4.2. Range</a></li>
<li><a href="#org32a66a3">4.3. Helper functions</a></li>
</ul>
</li>
<li><a href="#org239a5da">5. <span class="todo TODO">TODO</span> Basis set</a>
<ul>
<li><a href="#orgc97bb9b">5.1. Data structure</a></li>
<li><a href="#org185dc35">5.2. <code>qmckl_context_update_ao_basis</code></a>
<ul>
<li><a href="#org14dbdd7">5.2.1. Source</a></li>
<li><a href="#orgcf2dd54">5.2.2. Fortran interface</a></li>
<li><a href="#orgf80cc12">5.2.3. <span class="todo TODO">TODO</span> Test</a></li>
</ul>
</li>
<li><a href="#org9d381d2">5.3. <code>qmckl_context_set_ao_basis</code></a>
<ul>
<li><a href="#org44b52f3">5.3.1. Source</a></li>
<li><a href="#orgefcb70a">5.3.2. Fortran interface</a></li>
<li><a href="#orgf5560b3">5.3.3. <span class="todo TODO">TODO</span> Test</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
The context variable is a handle for the state of the library,
and is stored in a data structure which can't be seen outside of
the library.  To simplify compatibility with other languages, the
pointer to the internal data structure is converted into a 64-bit
signed integer, defined in the <code>qmckl_context</code> type.
A value of <code>QMCKL_NULL_CONTEXT</code> for the context is equivalent to a
<code>NULL</code> pointer.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">typedef</span> <span style="color: #228b22;">int64_t</span> <span style="color: #228b22;">qmckl_context</span> ;
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">QMCKL_NULL_CONTEXT</span> (qmckl_context) 0
</pre>
</div>

<div id="outline-container-org95a04bd" class="outline-2">
<h2 id="org95a04bd"><span class="section-number-2">1</span> Context handling</h2>
<div class="outline-text-2" id="text-1">
<p>
The context appears as an immutable data structure: modifying a
context returns a new context with the modifications.  Therefore, it
is necessary to store a pointer to the old version of context so
that it can be freed when necessary.
Note that we also provide a possibility to mutate the context, but
this should be done with caution, only when it is justified.
</p>

<p>
By convention, in this file <code>context</code> is a <code>qmckl_context</code> variable
and <code>ctx</code> is a <code>qmckl_context_struct*</code> pointer.
</p>
</div>

<div id="outline-container-orga7ca711" class="outline-3">
<h3 id="orga7ca711"><span class="section-number-3">1.1</span> Data structure</h3>
<div class="outline-text-3" id="text-1-1">
<p>
The main data structure contains pointers to other data structures,
containing the data specific to each given domain, such that the
modified contexts don't need to duplicate the data but only the
pointers.
</p>

<div class="org-src-container">
<pre class="src src-c" id="org08b6aaa"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_context_struct</span> {

  /* <span style="color: #b22222;">Pointer to the previous context, before modification </span>*/
  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_context_struct</span> * <span style="color: #a0522d;">prev</span>;

  /* <span style="color: #b22222;">Molecular system </span>*/
  <span style="color: #228b22;">qmckl_ao_basis_struct</span>    * <span style="color: #a0522d;">ao_basis</span>;

  /* <span style="color: #b22222;">To be implemented:</span>
<span style="color: #b22222;">  qmckl_nucleus_struct     * nucleus;</span>
<span style="color: #b22222;">  qmckl_electron_struct    * electron;</span>
<span style="color: #b22222;">  qmckl_mo_struct          * mo;</span>
<span style="color: #b22222;">  qmckl_determinant_struct * det;</span>
<span style="color: #b22222;">  </span>*/

  /* <span style="color: #b22222;">Numerical precision </span>*/
  <span style="color: #228b22;">qmckl_precision_struct</span>   * <span style="color: #a0522d;">fp</span>;

  /* <span style="color: #b22222;">Error handling </span>*/
  <span style="color: #228b22;">qmckl_error_struct</span>       * <span style="color: #a0522d;">error</span>;

  /* <span style="color: #b22222;">Memory allocation </span>*/
  <span style="color: #228b22;">qmckl_memory_struct</span>      * <span style="color: #a0522d;">alloc</span>;

  /* <span style="color: #b22222;">Thread lock </span>*/
  <span style="color: #228b22;">int</span>                        <span style="color: #a0522d;">lock_count</span>;
  <span style="color: #228b22;">pthread_mutex_t</span>            <span style="color: #a0522d;">mutex</span>;

  /* <span style="color: #b22222;">Validity checking </span>*/
  <span style="color: #228b22;">uint32_t</span>                   <span style="color: #a0522d;">tag</span>;

} <span style="color: #228b22;">qmckl_context_struct</span>;
</pre>
</div>


<p>
A tag is used internally to check if the memory domain pointed
by a pointer is a valid context. This allows to check that even if
the pointer associated with a context is non-null, we can still
verify that it points to the expected data structure.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">VALID_TAG</span>   0xBEEFFACE
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">INVALID_TAG</span> 0xDEADBEEF
</pre>
</div>

<p>
The <code>qmckl_context_check</code> function checks if the domain pointed by
the pointer is a valid context. It returns the input <code>qmckl_context</code>
if the context is valid, <code>QMCKL_NULL_CONTEXT</code> otherwise.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_context</span> <span style="color: #0000ff;">qmckl_context_check</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) ;
</pre>
</div>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_context</span> <span style="color: #0000ff;">qmckl_context_check</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {

  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT)
    <span style="color: #a020f0;">return</span> QMCKL_NULL_CONTEXT;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;

  /* <span style="color: #b22222;">Try to access memory </span>*/
  <span style="color: #a020f0;">if</span> (ctx-&gt;tag != VALID_TAG) {
      <span style="color: #a020f0;">return</span> QMCKL_NULL_CONTEXT;
  }

  <span style="color: #a020f0;">return</span> context;
}
</pre>
</div>
</div>
</div>
