qmckl_context.html

<div id="outline-container-org9f6d849" class="outline-3">
<h3 id="org9f6d849"><span class="section-number-3">1.2</span> Creation</h3>
<div class="outline-text-3" id="text-1-2">
<p>
To create a new context, <code>qmckl_context_create()</code> should be used.
</p>
<ul class="org-ul">
<li>Upon success, it returns a pointer to a new context with the <code>qmckl_context</code> type</li>
<li>It returns <code>QMCKL_NULL_CONTEXT</code> upon failure to allocate the internal data structure</li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_context</span> <span style="color: #0000ff;">qmckl_context_create</span>() {

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> =
    (<span style="color: #228b22;">qmckl_context_struct</span>*) <span style="color: #0000ff;">qmckl_malloc</span> (QMCKL_NULL_CONTEXT, <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">qmckl_context_struct</span>));

  <span style="color: #a020f0;">if</span> (ctx == <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> QMCKL_NULL_CONTEXT;
  }

  /* <span style="color: #b22222;">Set all pointers to NULL </span>*/
  memset(ctx, 0, <span style="color: #a020f0;">sizeof</span>(qmckl_context_struct));

  /* <span style="color: #b22222;">Initialize lock </span>*/
  init_lock(&amp;(ctx-&gt;mutex));

  /* <span style="color: #b22222;">Initialize data </span>*/
  ctx-&gt;tag = VALID_TAG;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span> = (<span style="color: #228b22;">qmckl_context</span>) ctx;
  assert ( qmckl_context_check(context) != QMCKL_NULL_CONTEXT );

  <span style="color: #a020f0;">return</span> context;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb851511" class="outline-3">
<h3 id="orgb851511"><span class="section-number-3">1.3</span> Access to the previous context</h3>
<div class="outline-text-3" id="text-1-3">
<p>
<code>qmckl_context_previous</code> returns the previous context. It returns
<code>QMCKL_NULL_CONTEXT</code> for the initial context and for the <code>NULL</code> context.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_context</span> <span style="color: #0000ff;">qmckl_context_previous</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">checked_context</span> = qmckl_context_check(context);
  <span style="color: #a020f0;">if</span> (checked_context == (<span style="color: #228b22;">qmckl_context</span>) 0) {
    <span style="color: #a020f0;">return</span> (<span style="color: #228b22;">qmckl_context</span>) 0;
  }

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) checked_context;
  <span style="color: #a020f0;">return</span> qmckl_context_check((<span style="color: #228b22;">qmckl_context</span>) ctx-&gt;prev);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb4cd544" class="outline-3">
<h3 id="orgb4cd544"><span class="section-number-3">1.4</span> Locking</h3>
<div class="outline-text-3" id="text-1-4">
<p>
For thread safety, the context may be locked/unlocked. The lock is
initialized with the <code>PTHREAD_MUTEX_RECURSIVE</code> attribute, and the
number of times the thread has locked it is saved in the
<code>lock_count</code> attribute.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">init_lock</span>(<span style="color: #228b22;">pthread_mutex_t</span>* <span style="color: #a0522d;">mutex</span>) {
  <span style="color: #228b22;">pthread_mutexattr_t</span> <span style="color: #a0522d;">attr</span>;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span>;

  rc = pthread_mutexattr_init(&amp;attr); 
  assert (rc == 0);

  (<span style="color: #228b22;">void</span>) pthread_mutexattr_settype(&amp;attr, PTHREAD_MUTEX_RECURSIVE);

  rc = pthread_mutex_init ( mutex, &amp;attr);
  assert (rc == 0);

  (<span style="color: #228b22;">void</span>)pthread_mutexattr_destroy(&amp;attr);
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">qmckl_lock</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {
  <span style="color: #a020f0;">if</span> (context == QMCKL_NULL_CONTEXT)
    <span style="color: #a020f0;">return</span> ;
  <span style="color: #228b22;">qmckl_context_struct</span> *<span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;
  errno = 0;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span> = pthread_mutex_lock( &amp;(ctx-&gt;mutex) );
  <span style="color: #a020f0;">if</span> (rc != 0) {
    fprintf(stderr, <span style="color: #8b2252;">"qmckl_lock:%s\n"</span>, strerror(rc) );
    fflush(stderr);
  }
  assert (rc == 0);
  ctx-&gt;lock_count++;
/*
<span style="color: #b22222;">  printf("  lock : %d\n", ctx-&gt;lock_count);</span>
*/
}

<span style="color: #228b22;">void</span> <span style="color: #0000ff;">qmckl_unlock</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {
  <span style="color: #228b22;">qmckl_context_struct</span> *<span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;
  <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc</span> = pthread_mutex_unlock( &amp;(ctx-&gt;mutex) );
  <span style="color: #a020f0;">if</span> (rc != 0) {
    fprintf(stderr, <span style="color: #8b2252;">"qmckl_unlock:%s\n"</span>, strerror(rc) );
    fflush(stderr);
  }
  assert (rc == 0);
  ctx-&gt;lock_count--;
/*
<span style="color: #b22222;">  printf("unlock : %d\n", ctx-&gt;lock_count);</span>
*/
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc4c8967" class="outline-3">
<h3 id="orgc4c8967"><span class="section-number-3">1.5</span> Copy</h3>
<div class="outline-text-3" id="text-1-5">
<p>
<code>qmckl_context_copy</code> makes a shallow copy of a context. It returns
<code>QMCKL_NULL_CONTEXT</code> upon failure.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_context</span> <span style="color: #0000ff;">qmckl_context_copy</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {

  qmckl_lock(context);

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">checked_context</span> = qmckl_context_check(context);

  <span style="color: #a020f0;">if</span> (checked_context == QMCKL_NULL_CONTEXT) {
    qmckl_unlock(context);
    <span style="color: #a020f0;">return</span> QMCKL_NULL_CONTEXT;
  }


  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">old_ctx</span> =
    (<span style="color: #228b22;">qmckl_context_struct</span>*) checked_context;

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">new_ctx</span> =
    (<span style="color: #228b22;">qmckl_context_struct</span>*) <span style="color: #0000ff;">qmckl_malloc</span> (context, <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">qmckl_context_struct</span>));

  <span style="color: #a020f0;">if</span> (new_ctx == <span style="color: #008b8b;">NULL</span>) {
    qmckl_unlock(context);
    <span style="color: #a020f0;">return</span> QMCKL_NULL_CONTEXT;
  }

  /* <span style="color: #b22222;">Copy the old context on the new one </span>*/
  memcpy(new_ctx, old_ctx, <span style="color: #a020f0;">sizeof</span>(qmckl_context_struct));

  new_ctx-&gt;prev = old_ctx;

  qmckl_unlock( (<span style="color: #228b22;">qmckl_context</span>) new_ctx );
  qmckl_unlock( (<span style="color: #228b22;">qmckl_context</span>) old_ctx );

  <span style="color: #a020f0;">return</span> (<span style="color: #228b22;">qmckl_context</span>) new_ctx;
}

</pre>
</div>
</div>
</div>
