qmckl_context.html
<div id="outline-container-org9b95ba0" class="outline-3">
<h3 id="org9b95ba0"><span class="section-number-3">1.6</span> Destroy</h3>
<div class="outline-text-3" id="text-1-6">
<p>
The context is destroyed with <code>qmckl_context_destroy</code>, leaving the ancestors untouched.
It frees the context, and returns the previous context.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_context</span> <span style="color: #0000ff;">qmckl_context_destroy</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">checked_context</span> = qmckl_context_check(context);
  <span style="color: #a020f0;">if</span> (checked_context == QMCKL_NULL_CONTEXT) <span style="color: #a020f0;">return</span> QMCKL_NULL_CONTEXT;

  qmckl_lock(context);

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;
  assert (ctx != <span style="color: #008b8b;">NULL</span>);  /* <span style="color: #b22222;">Shouldn't be true because the context is valid </span>*/

  qmckl_unlock(context);

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">prev_context</span> = (<span style="color: #228b22;">qmckl_context</span>) ctx-&gt;prev;
  <span style="color: #a020f0;">if</span> (prev_context == QMCKL_NULL_CONTEXT) {
    /* <span style="color: #b22222;">This is the first context, free all memory. </span>*/
    <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_memory_struct</span>* <span style="color: #a0522d;">new</span> = <span style="color: #008b8b;">NULL</span>;
    <span style="color: #a020f0;">while</span> (ctx-&gt;alloc != <span style="color: #008b8b;">NULL</span>) {
       new = ctx-&gt;alloc-&gt;next;
       free(ctx-&gt;alloc-&gt;pointer);
       ctx-&gt;alloc-&gt;pointer = <span style="color: #008b8b;">NULL</span>;
       free(ctx-&gt;alloc);
       ctx-&gt;alloc = new;
    }
  }

  <span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">rc</span>;
  rc = qmckl_context_remove_memory(context,ctx);
/*
<span style="color: #b22222;">  assert (rc == QMCKL_SUCCESS);</span>
<span style="color: #b22222;">  </span>*/

  ctx-&gt;tag = INVALID_TAG;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">rc_destroy</span> = pthread_mutex_destroy( &amp;(ctx-&gt;mutex) );
  <span style="color: #a020f0;">if</span> (rc_destroy != 0) {
     fprintf(stderr, <span style="color: #8b2252;">"qmckl_context_destroy: %s (count = %d)\n"</span>, strerror(rc_destroy), ctx-&gt;lock_count);
     abort();
  }

  rc = qmckl_free(context,ctx);
  assert (rc == QMCKL_SUCCESS);

  //<span style="color: #b22222;">memset(ctx, 0, sizeof(qmckl_context_struct));</span>


  <span style="color: #a020f0;">return</span> prev_context;
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0f2231c" class="outline-2">
<h2 id="org0f2231c"><span class="section-number-2">2</span> Memory allocation handling</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4b12848" class="outline-3">
<h3 id="org4b12848"><span class="section-number-3">2.1</span> Data structure</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Pointers to all allocated memory domains are stored in the context,
in a linked list. The size is also stored, to enable the
computation of the amount of currently used memory by the library.
</p>

<div class="org-src-container">
<pre class="src src-c" id="orga1b5251"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_memory_struct</span> {
  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_memory_struct</span> * <span style="color: #a0522d;">next</span>    ;
  <span style="color: #228b22;">void</span>                       * <span style="color: #a0522d;">pointer</span> ;
  <span style="color: #228b22;">size_t</span>                       <span style="color: #a0522d;">size</span>    ;
} <span style="color: #228b22;">qmckl_memory_struct</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb628973" class="outline-3">
<h3 id="orgb628973"><span class="section-number-3">2.2</span> Append memory</h3>
<div class="outline-text-3" id="text-2-2">
<p>
The following function, called in <a href="./qmckl_memory.html"><code>qmckl_memory.c</code></a>, appends a new
pair (pointer, size) to the data structure.
It is forbidden to pass the <code>NULL</code> pointer, or a zero size.
If the context is <code>QMCKL_NULL_CONTEXT</code>, the function returns
immediately with <code>QMCKL_SUCCESS</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_context_append_memory</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                                            <span style="color: #228b22;">void</span>* <span style="color: #a0522d;">pointer</span>,
                                            <span style="color: #a020f0;">const</span> <span style="color: #228b22;">size_t</span> <span style="color: #a0522d;">size</span>) {
  assert (pointer != <span style="color: #008b8b;">NULL</span>);
  assert (size &gt; 0L);

  qmckl_lock(context);

  <span style="color: #a020f0;">if</span> ( qmckl_context_check(context) == QMCKL_NULL_CONTEXT ) {
    qmckl_unlock(context);
    <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
  }

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context; 

  <span style="color: #228b22;">qmckl_memory_struct</span>* <span style="color: #a0522d;">new_alloc</span> = (<span style="color: #228b22;">qmckl_memory_struct</span>*)
    malloc(<span style="color: #a020f0;">sizeof</span>(qmckl_memory_struct));

  <span style="color: #a020f0;">if</span> (new_alloc == <span style="color: #008b8b;">NULL</span>) {
    qmckl_unlock(context);
    <span style="color: #a020f0;">return</span> QMCKL_ALLOCATION_FAILED;
  }

  new_alloc-&gt;next    = <span style="color: #008b8b;">NULL</span>;
  new_alloc-&gt;pointer = pointer;
  new_alloc-&gt;size    = size;

  <span style="color: #228b22;">qmckl_memory_struct</span>* <span style="color: #a0522d;">alloc</span> = ctx-&gt;alloc;
  <span style="color: #a020f0;">if</span> (alloc == <span style="color: #008b8b;">NULL</span>) {
    ctx-&gt;alloc = new_alloc;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">while</span> (alloc != <span style="color: #008b8b;">NULL</span>) {
      alloc = alloc-&gt;next;
    }
    alloc-&gt;next = new_alloc;
  }

  qmckl_unlock(context);

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;

}
</pre>
</div>
</div>
</div>
