src/qmckl_context.org
** Remove memory
   
   The following function, called in [[./qmckl_memory.html][=qmckl_memory.c=]], removes a 
   pointer from the data structure.
   It is forbidden to pass the ~NULL~ pointer.
   If the context is ~QMCKL_NULL_CONTEXT~, the function returns
   immediately with ~QMCKL_SUCCESS~.

   # Header
   #+begin_src c :comments org :tangle (eval h_private) :exports none
qmckl_exit_code qmckl_context_remove_memory(qmckl_context context,
                                            const void* pointer);
   #+end_src

   # Source
   #+begin_src c :comments org :tangle (eval c)
qmckl_exit_code qmckl_context_remove_memory(qmckl_context context,
                                            const void* pointer) {
  assert (pointer != NULL);

  qmckl_lock(context);

  if ( qmckl_context_check(context) == QMCKL_NULL_CONTEXT ) {
    qmckl_unlock(context);
    return QMCKL_SUCCESS;
  }

  qmckl_context_struct* ctx = (qmckl_context_struct*) context; 

  qmckl_memory_struct* alloc = ctx->alloc;
  qmckl_memory_struct* prev  = ctx->alloc;

  while ( (alloc != NULL) && (alloc->pointer != pointer) ) {
    prev = alloc;
    alloc = alloc->next;
  }
  
  if (alloc != NULL) {
    prev->next = alloc->next;
    free(alloc);
  } 
      
  qmckl_unlock(context);

  if (alloc != NULL) {
    return QMCKL_SUCCESS;
  } else {
    return QMCKL_DEALLOCATION_FAILED;
  }
}
   #+end_src

   #+RESULTS:
   
* Error handling

** Data structure
  
   #+NAME: qmckl_error_struct
   #+begin_src c :comments org :tangle no
#define  QMCKL_MAX_FUN_LEN   256
#define  QMCKL_MAX_MSG_LEN  1024

typedef struct qmckl_error_struct {

  qmckl_exit_code exit_code;
  char function[QMCKL_MAX_FUN_LEN];
  char message [QMCKL_MAX_MSG_LEN];

} qmckl_error_struct;
   #+end_src

