qmckl_context.html

<div id="outline-container-org2d326c6" class="outline-3">
<h3 id="org2d326c6"><span class="section-number-3">2.3</span> Remove memory</h3>
<div class="outline-text-3" id="text-2-3">
<p>
The following function, called in <a href="./qmckl_memory.html"><code>qmckl_memory.c</code></a>, removes a 
pointer from the data structure.
It is forbidden to pass the <code>NULL</code> pointer.
If the context is <code>QMCKL_NULL_CONTEXT</code>, the function returns
immediately with <code>QMCKL_SUCCESS</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_context_remove_memory</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                                            <span style="color: #a020f0;">const</span> <span style="color: #228b22;">void</span>* <span style="color: #a0522d;">pointer</span>) {
  assert (pointer != <span style="color: #008b8b;">NULL</span>);

  qmckl_lock(context);

  <span style="color: #a020f0;">if</span> ( qmckl_context_check(context) == QMCKL_NULL_CONTEXT ) {
    qmckl_unlock(context);
    <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
  }

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context; 

  <span style="color: #228b22;">qmckl_memory_struct</span>* <span style="color: #a0522d;">alloc</span> = ctx-&gt;alloc;
  <span style="color: #228b22;">qmckl_memory_struct</span>* <span style="color: #a0522d;">prev</span>  = ctx-&gt;alloc;

  <span style="color: #a020f0;">while</span> ( (alloc != <span style="color: #008b8b;">NULL</span>) &amp;&amp; (alloc-&gt;pointer != pointer) ) {
    prev = alloc;
    alloc = alloc-&gt;next;
  }

  <span style="color: #a020f0;">if</span> (alloc != <span style="color: #008b8b;">NULL</span>) {
    prev-&gt;next = alloc-&gt;next;
    free(alloc);
  } 

  qmckl_unlock(context);

  <span style="color: #a020f0;">if</span> (alloc != <span style="color: #008b8b;">NULL</span>) {
    <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
  } <span style="color: #a020f0;">else</span> {
    <span style="color: #a020f0;">return</span> QMCKL_DEALLOCATION_FAILED;
  }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc23251d" class="outline-2">
<h2 id="orgc23251d"><span class="section-number-2">3</span> Error handling</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgda9e324" class="outline-3">
<h3 id="orgda9e324"><span class="section-number-3">3.1</span> Data structure</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-c" id="org16476ce"><span style="color: #483d8b;">#define</span>  <span style="color: #a0522d;">QMCKL_MAX_FUN_LEN</span>   256
<span style="color: #483d8b;">#define</span>  <span style="color: #a0522d;">QMCKL_MAX_MSG_LEN</span>  1024

<span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_error_struct</span> {

  <span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">exit_code</span>;
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">function</span>[QMCKL_MAX_FUN_LEN];
  <span style="color: #228b22;">char</span> <span style="color: #a0522d;">message</span> [QMCKL_MAX_MSG_LEN];

} <span style="color: #228b22;">qmckl_error_struct</span>;
</pre>
</div>
</div>
</div>
