qmckl_context.html

<div id="outline-container-org1efeff8" class="outline-3">
<h3 id="org1efeff8"><span class="section-number-3">3.2</span> Updating errors</h3>
<div class="outline-text-3" id="text-3-2">
<p>
The error is updated in the context using
<code>qmckl_context_update_error</code>, although it is recommended to use
<code>qmckl_context_set_error</code> for the immutable variant.
When the error is set in the context, it is mandatory to specify
from which function the error is triggered, and a message
explaining the error. The exit code can't be <code>QMCKL_SUCCESS</code>.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_context_update_error</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                           <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">exit_code</span>,
                           <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">function_name</span>,
                           <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">message</span>)
{
  /* <span style="color: #b22222;">Passing a function name and a message is mandatory. </span>*/
  assert (function_name != <span style="color: #008b8b;">NULL</span>);
  assert (message != <span style="color: #008b8b;">NULL</span>);

  /* <span style="color: #b22222;">Exit codes are assumed valid. </span>*/
  assert (exit_code &gt;= 0);
  assert (exit_code != QMCKL_SUCCESS);
  assert (exit_code &lt; QMCKL_INVALID_EXIT_CODE);

  qmckl_lock(context);

  /* <span style="color: #b22222;">The context is assumed to exist. </span>*/
  assert (qmckl_context_check(context) != QMCKL_NULL_CONTEXT);

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;
  assert (ctx != <span style="color: #008b8b;">NULL</span>); /* <span style="color: #b22222;">Impossible because the context is valid. </span>*/

  <span style="color: #a020f0;">if</span> (ctx-&gt;error != <span style="color: #008b8b;">NULL</span>) {
    free(ctx-&gt;error);
    ctx-&gt;error = <span style="color: #008b8b;">NULL</span>;
  }

  <span style="color: #228b22;">qmckl_error_struct</span>* <span style="color: #a0522d;">error</span> =
    (<span style="color: #228b22;">qmckl_error_struct</span>*) <span style="color: #0000ff;">qmckl_malloc</span> (context, <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">qmckl_error_struct</span>));
  error-&gt;exit_code = exit_code;
  strcpy(error-&gt;function, function_name);
  strcpy(error-&gt;message, message);

  ctx-&gt;error = error;

  qmckl_unlock(context);

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>

<p>
The <code>qmckl_context_set_error</code> function returns a new context with
the error domain updated.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_context</span>
<span style="color: #0000ff;">qmckl_context_set_error</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                        <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">exit_code</span>,
                        <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">function_name</span>,
                        <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">message</span>)
{
  /* <span style="color: #b22222;">Passing a function name and a message is mandatory. </span>*/
  assert (function_name != <span style="color: #008b8b;">NULL</span>);
  assert (message != <span style="color: #008b8b;">NULL</span>);

  /* <span style="color: #b22222;">Exit codes are assumed valid. </span>*/
  assert (exit_code &gt;= 0);
  assert (exit_code != QMCKL_SUCCESS);
  assert (exit_code &lt; QMCKL_INVALID_EXIT_CODE);

  /* <span style="color: #b22222;">The context is assumed to be valid </span>*/
  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT)
    <span style="color: #a020f0;">return</span> QMCKL_NULL_CONTEXT;

  <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">new_context</span> = qmckl_context_copy(context);

  /* <span style="color: #b22222;">Should be impossible because the context is valid </span>*/
  assert (new_context != QMCKL_NULL_CONTEXT);

  <span style="color: #a020f0;">if</span> (qmckl_context_update_error(new_context,
                                 exit_code,
                                 function_name,
                                 message) != QMCKL_SUCCESS) {
    <span style="color: #a020f0;">return</span> context;
  }

  <span style="color: #a020f0;">return</span> new_context;
}
</pre>
</div>


<p>
To make a function fail, the <code>qmckl_failwith</code> function should be
called, such that information about the failure is stored in
the context. The desired exit code is given as an argument, as
well as the name of the function and an error message. The return
code of the function is the desired return code.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_failwith</span>(<span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>,
                               <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">exit_code</span>,
                               <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">function</span>,
                               <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>* <span style="color: #a0522d;">message</span>) {

  assert (exit_code &gt; 0);
  assert (exit_code &lt; QMCKL_INVALID_EXIT_CODE);
  assert (function != <span style="color: #008b8b;">NULL</span>);
  assert (message  != <span style="color: #008b8b;">NULL</span>);
  assert (strlen(function) &lt; QMCKL_MAX_FUN_LEN);
  assert (strlen(message)  &lt; QMCKL_MAX_MSG_LEN);

  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT)
    <span style="color: #a020f0;">return</span> QMCKL_NULL_CONTEXT;

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #a0522d;">rc</span> = 
    qmckl_context_update_error(context, exit_code, function, message);

  assert (rc == QMCKL_SUCCESS);

  <span style="color: #a020f0;">return</span> exit_code;
}

</pre>
</div>

<p>
For example, this function can be used as
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #a020f0;">if</span> (x &lt; 0) {
  <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                        QMCKL_INVALID_ARG_2,
                        <span style="color: #8b2252;">"qmckl_function"</span>, 
                        <span style="color: #8b2252;">"Expected x &gt;= 0"</span>);
 }
</pre>
</div>
</div>
</div>
</div>
