src/qmckl_context.org
* Control of the numerical precision

 Controlling numerical precision enables optimizations. Here, the                                                             
 default parameters determining the target numerical precision and                                                            
 range are defined.                                                                                                           
                                                                                                                              
 #+NAME: table-precision                                                                                                      
 | ~QMCKL_DEFAULT_PRECISION~ | 53 |
 | ~QMCKL_DEFAULT_RANGE~     | 11 |
                                                                                                                              
 # We need to force Emacs not to indent the Python code:                                                                      
 # -*- org-src-preserve-indentation: t                                                                                        
                                                                                                                              
#+begin_src python :var table=table-precision  :results drawer :exports result                                                
""" This script generates the C and Fortran constants for the error
    codes from the org-mode table.
"""

result = [ "#+begin_src c :comments org :tangle (eval h)" ]
for (text, code) in table:
    text=text.replace("~","")
    result += [ f"#define  {text:30s} {code:d}" ]
result += [ "#+end_src" ]

result += [ "" ]

result += [ "#+begin_src f90 :comments org :tangle (eval fh) :exports none" ]
for (text, code) in table:
    text=text.replace("~","")
    result += [ f"   integer, parameter :: {text:30s} = {code:d}" ]
result += [ "#+end_src" ]

return '\n'.join(result)

#+end_src

#+RESULTS:
:results:
#+begin_src c :comments org :tangle (eval h)
#define  QMCKL_DEFAULT_PRECISION        53
#define  QMCKL_DEFAULT_RANGE            11
#+end_src

#+begin_src f90 :comments org :tangle (eval fh) :exports none
   integer, parameter :: QMCKL_DEFAULT_PRECISION        = 53
   integer, parameter :: QMCKL_DEFAULT_RANGE            = 11
#+end_src
:end:

    #+NAME: qmckl_precision_struct
    #+begin_src c :comments org :tangle no
typedef struct qmckl_precision_struct {
  int  precision;
  int  range;
} qmckl_precision_struct;
    #+end_src
  
  The following functions set and get the required precision and
  range. ~precision~ is an integer between 2 and 53, and ~range~ is an
  integer between 2 and 11.

  The setter functions functions return a new context as a 64-bit
  integer. The getter functions return the value, as a 32-bit
  integer. The update functions return ~QMCKL_SUCCESS~ or
  ~QMCKL_FAILURE~.

