qmckl_context.html

<div id="outline-container-orga04bd35" class="outline-2">
<h2 id="orga04bd35"><span class="section-number-2">4</span> Control of the numerical precision</h2>
<div class="outline-text-2" id="text-4">
<p>
Controlling numerical precision enables optimizations. Here, the                                                             
default parameters determining the target numerical precision and                                                            
range are defined.                                                                                                           
</p>

<table id="org60fea84" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>QMCKL_DEFAULT_PRECISION</code></td>
<td class="org-right">53</td>
</tr>

<tr>
<td class="org-left"><code>QMCKL_DEFAULT_RANGE</code></td>
<td class="org-right">11</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #8b2252;">""" This script generates the C and Fortran constants for the error</span>
<span style="color: #8b2252;">    codes from the org-mode table.</span>
<span style="color: #8b2252;">"""</span>

<span style="color: #a0522d;">result</span> = [ <span style="color: #8b2252;">"#+begin_src c :comments org :tangle (eval h)"</span> ]
<span style="color: #a020f0;">for</span> (text, code) <span style="color: #a020f0;">in</span> table:
    <span style="color: #a0522d;">text</span>=text.replace(<span style="color: #8b2252;">"~"</span>,<span style="color: #8b2252;">""</span>)
    <span style="color: #a0522d;">result</span> += [ f<span style="color: #8b2252;">"#define  {text:30s} {code:d}"</span> ]
<span style="color: #a0522d;">result</span> += [ <span style="color: #8b2252;">"#+end_src"</span> ]

<span style="color: #a0522d;">result</span> += [ <span style="color: #8b2252;">""</span> ]

<span style="color: #a0522d;">result</span> += [ <span style="color: #8b2252;">"#+begin_src f90 :comments org :tangle (eval fh) :exports none"</span> ]
<span style="color: #a020f0;">for</span> (text, code) <span style="color: #a020f0;">in</span> table:
    <span style="color: #a0522d;">text</span>=text.replace(<span style="color: #8b2252;">"~"</span>,<span style="color: #8b2252;">""</span>)
    <span style="color: #a0522d;">result</span> += [ f<span style="color: #8b2252;">"   integer, parameter :: {text:30s} = {code:d}"</span> ]
<span style="color: #a0522d;">result</span> += [ <span style="color: #8b2252;">"#+end_src"</span> ]

<span style="color: #a020f0;">return</span> <span style="color: #8b2252;">'\n'</span>.join(result)

</pre>
</div>

<div class="org-src-container">
<pre class="src src-c" id="org6bed533"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_precision_struct</span> {
  <span style="color: #228b22;">int</span>  <span style="color: #a0522d;">precision</span>;
  <span style="color: #228b22;">int</span>  <span style="color: #a0522d;">range</span>;
} <span style="color: #228b22;">qmckl_precision_struct</span>;
</pre>
</div>

<p>
The following functions set and get the required precision and
range. <code>precision</code> is an integer between 2 and 53, and <code>range</code> is an
integer between 2 and 11.
</p>

<p>
The setter functions functions return a new context as a 64-bit
integer. The getter functions return the value, as a 32-bit
integer. The update functions return <code>QMCKL_SUCCESS</code> or
<code>QMCKL_FAILURE</code>.
</p>
</div>
