src/qmckl_context.org
** Precision
   ~qmckl_context_update_precision~ modifies the parameter for the
   numerical precision in a context. If the context doesn't have any
   precision set yet, the default values are used.

   # Header
   #+begin_src c :comments org :tangle (eval h) :exports none
qmckl_exit_code qmckl_context_update_precision(const qmckl_context context, const int precision);
   #+end_src

   # Source
   #+begin_src c :tangle (eval c)
qmckl_exit_code qmckl_context_update_precision(const qmckl_context context, const int precision) {

  if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT)
    return QMCKL_INVALID_CONTEXT;

if (precision <  2) {
  return qmckl_failwith(context,
                  QMCKL_INVALID_ARG_2,
                  "qmckl_context_update_precision",
                  "precision < 2");
 }

if (precision > 53) {
  return qmckl_failwith(context,
                  QMCKL_INVALID_ARG_2,
                  "qmckl_context_update_precision",
                  "precision > 53");
 }

qmckl_context_struct* ctx = (qmckl_context_struct*) context;

/* This should be always true */
assert (ctx != NULL);

qmckl_lock(context);

if (ctx->fp == NULL) {

  ctx->fp = (qmckl_precision_struct*)
    qmckl_malloc(context, sizeof(qmckl_precision_struct));

  if (ctx->fp == NULL) {
    return qmckl_failwith(context,
                    QMCKL_ALLOCATION_FAILED,
                    "qmckl_context_update_precision",
                    "ctx->fp");
  }

  ctx->fp->precision = QMCKL_DEFAULT_PRECISION;
  ctx->fp->range     = QMCKL_DEFAULT_RANGE;
 }

ctx->fp->precision = precision;

qmckl_unlock(context);

return QMCKL_SUCCESS;
}
   #+end_src

   # Fortran interface

   #+begin_src f90 :tangle (eval fh)
  interface
     integer (c_int32_t) function qmckl_context_update_precision(context, precision) bind(C)
       use, intrinsic :: iso_c_binding
       integer (c_int64_t), intent(in), value :: context
       integer (c_int32_t), intent(in), value :: precision
     end function qmckl_context_update_precision
  end interface
   #+end_src

   ~qmckl_context_set_precision~ returns a copy of the context with a
   different precision parameter.

   #+begin_src c :comments org :tangle (eval h) :exports none
qmckl_context qmckl_context_set_precision(const qmckl_context context, const int precision);
   #+end_src

   # Source
   #+begin_src c :tangle (eval c)
qmckl_context qmckl_context_set_precision(const qmckl_context context, const int precision) {
  qmckl_context new_context = qmckl_context_copy(context);
  if (new_context == 0) return 0;

  if (qmckl_context_update_precision(new_context, precision) == QMCKL_FAILURE) return 0;

  return new_context;
}
   #+end_src

   # Fortran interface
   #+begin_src f90 :tangle (eval fh) :exports none
  interface
     integer (c_int64_t) function qmckl_context_set_precision(context, precision) bind(C)
       use, intrinsic :: iso_c_binding
       integer (c_int64_t), intent(in), value :: context
       integer (c_int32_t), intent(in), value :: precision
     end function qmckl_context_set_precision
  end interface
   #+end_src
     
   ~qmckl_context_get_precision~ returns the value of the numerical precision in the context.

   #+begin_src c :comments org :tangle (eval h) :exports none
int32_t qmckl_context_get_precision(const qmckl_context context);
   #+end_src

   # Source
   #+begin_src c :tangle (eval c)
int qmckl_context_get_precision(const qmckl_context context) {
  if (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
      return qmckl_failwith(context,
                      QMCKL_INVALID_CONTEXT,
                      "qmckl_context_get_precision",
                      "");
  }

  const qmckl_context_struct* ctx = (qmckl_context_struct*) context;
  if (ctx->fp != NULL) 
    return ctx->fp->precision;
  else
    return QMCKL_DEFAULT_PRECISION;
}
   #+end_src
    
   # Fortran interface
   #+begin_src f90 :tangle (eval fh)
  interface
     integer (c_int32_t) function qmckl_context_get_precision(context) bind(C)
       use, intrinsic :: iso_c_binding
       integer (c_int64_t), intent(in), value :: context
     end function qmckl_context_get_precision
  end interface
   #+end_src

