qmckl_context.html

<div id="outline-container-org8114fc0" class="outline-3">
<h3 id="org8114fc0"><span class="section-number-3">4.1</span> Precision</h3>
<div class="outline-text-3" id="text-4-1">
<p>
<code>qmckl_context_update_precision</code> modifies the parameter for the
numerical precision in a context. If the context doesn't have any
precision set yet, the default values are used.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_context_update_precision</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">precision</span>) {

  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT)
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_CONTEXT;

  <span style="color: #a020f0;">if</span> (precision &lt;  2) {
    <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                          QMCKL_INVALID_ARG_2,
                          <span style="color: #8b2252;">"qmckl_context_update_precision"</span>,
                          <span style="color: #8b2252;">"precision &lt; 2"</span>);
  }

  <span style="color: #a020f0;">if</span> (precision &gt; 53) {
    <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                          QMCKL_INVALID_ARG_2,
                          <span style="color: #8b2252;">"qmckl_context_update_precision"</span>,
                          <span style="color: #8b2252;">"precision &gt; 53"</span>);
  }

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;

  /* <span style="color: #b22222;">This should be always true </span>*/
  assert (ctx != <span style="color: #008b8b;">NULL</span>);

  qmckl_lock(context);

  <span style="color: #a020f0;">if</span> (ctx-&gt;fp == <span style="color: #008b8b;">NULL</span>) {

    ctx-&gt;fp = (<span style="color: #228b22;">qmckl_precision_struct</span>*)
      qmckl_malloc(context, <span style="color: #a020f0;">sizeof</span>(qmckl_precision_struct));

    <span style="color: #a020f0;">if</span> (ctx-&gt;fp == <span style="color: #008b8b;">NULL</span>) {
      <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                            QMCKL_ALLOCATION_FAILED,
                            <span style="color: #8b2252;">"qmckl_context_update_precision"</span>,
                            <span style="color: #8b2252;">"ctx-&gt;fp"</span>);
    }

    ctx-&gt;fp-&gt;precision = QMCKL_DEFAULT_PRECISION;
    ctx-&gt;fp-&gt;range     = QMCKL_DEFAULT_RANGE;
  }

  ctx-&gt;fp-&gt;precision = precision;

  qmckl_unlock(context);

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">interface</span>
   <span style="color: #228b22;">integer</span> (<span style="color: #008b8b;">c_int32_t</span>) <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">qmckl_context_update_precision</span>(context, precision) <span style="color: #a020f0;">bind</span>(C)
     <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
     <span style="color: #228b22;">integer</span> (<span style="color: #008b8b;">c_int64_t</span>), <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span> ::<span style="color: #a0522d;"> context</span>
     <span style="color: #228b22;">integer</span> (<span style="color: #008b8b;">c_int32_t</span>), <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span> ::<span style="color: #a0522d;"> precision</span>
   <span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_context_update_precision</span>
<span style="color: #a020f0;">end interface</span>
</pre>
</div>

<p>
<code>qmckl_context_set_precision</code> returns a copy of the context with a
different precision parameter.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_context</span> <span style="color: #0000ff;">qmckl_context_set_precision</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">precision</span>) {
  <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">new_context</span> = qmckl_context_copy(context);
  <span style="color: #a020f0;">if</span> (new_context == 0) <span style="color: #a020f0;">return</span> 0;

  <span style="color: #a020f0;">if</span> (qmckl_context_update_precision(new_context, precision) == QMCKL_FAILURE) <span style="color: #a020f0;">return</span> 0;

  <span style="color: #a020f0;">return</span> new_context;
}
</pre>
</div>

<p>
<code>qmckl_context_get_precision</code> returns the value of the numerical precision in the context.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">qmckl_context_get_precision</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {
  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
      <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                      QMCKL_INVALID_CONTEXT,
                      <span style="color: #8b2252;">"qmckl_context_get_precision"</span>,
                      <span style="color: #8b2252;">""</span>);
  }

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;
  <span style="color: #a020f0;">if</span> (ctx-&gt;fp != <span style="color: #008b8b;">NULL</span>) 
    <span style="color: #a020f0;">return</span> ctx-&gt;fp-&gt;precision;
  <span style="color: #a020f0;">else</span>
    <span style="color: #a020f0;">return</span> QMCKL_DEFAULT_PRECISION;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">interface</span>
   <span style="color: #228b22;">integer</span> (<span style="color: #008b8b;">c_int32_t</span>) <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">qmckl_context_get_precision</span>(context) <span style="color: #a020f0;">bind</span>(C)
     <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
     <span style="color: #228b22;">integer</span> (<span style="color: #008b8b;">c_int64_t</span>), <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span> ::<span style="color: #a0522d;"> context</span>
   <span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_context_get_precision</span>
<span style="color: #a020f0;">end interface</span>
</pre>
</div>
</div>
</div>
