qmckl_context.html

<div id="outline-container-orgfe3627f" class="outline-3">
<h3 id="orgfe3627f"><span class="section-number-3">4.2</span> Range</h3>
<div class="outline-text-3" id="text-4-2">
<p>
<code>qmckl_context_update_range</code> modifies the parameter for the numerical range in a given context.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span> <span style="color: #0000ff;">qmckl_context_update_range</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">range</span>) {

  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT)
    <span style="color: #a020f0;">return</span> QMCKL_INVALID_CONTEXT;

  <span style="color: #a020f0;">if</span> (range &lt;  2) {
    <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                    QMCKL_INVALID_ARG_2,
                    <span style="color: #8b2252;">"qmckl_context_update_range"</span>,
                    <span style="color: #8b2252;">"range &lt; 2"</span>);
  }

  <span style="color: #a020f0;">if</span> (range &gt; 11) {
    <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                    QMCKL_INVALID_ARG_2,
                    <span style="color: #8b2252;">"qmckl_context_update_range"</span>,
                    <span style="color: #8b2252;">"range &gt; 11"</span>);
  }

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;

  /* <span style="color: #b22222;">This should be always true </span>*/
  assert (ctx != <span style="color: #008b8b;">NULL</span>);

  qmckl_lock(context);

  <span style="color: #a020f0;">if</span> (ctx-&gt;fp == <span style="color: #008b8b;">NULL</span>) {

    ctx-&gt;fp = (<span style="color: #228b22;">qmckl_precision_struct</span>*)
      qmckl_malloc(context, <span style="color: #a020f0;">sizeof</span>(qmckl_precision_struct));

    <span style="color: #a020f0;">if</span> (ctx-&gt;fp == <span style="color: #008b8b;">NULL</span>) {
      <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                      QMCKL_ALLOCATION_FAILED,
                      <span style="color: #8b2252;">"qmckl_context_update_range"</span>,
                      <span style="color: #8b2252;">"ctx-&gt;fp"</span>);
    }

    ctx-&gt;fp-&gt;precision = QMCKL_DEFAULT_PRECISION;
    ctx-&gt;fp-&gt;range     = QMCKL_DEFAULT_RANGE;
  }

  ctx-&gt;fp-&gt;range = range;

  qmckl_unlock(context);

  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-f90"><span style="color: #a020f0;">interface</span>
   <span style="color: #228b22;">integer</span> (<span style="color: #008b8b;">c_int32_t</span>) <span style="color: #a020f0;">function</span> <span style="color: #0000ff;">qmckl_context_update_range</span>(context, range) <span style="color: #a020f0;">bind</span>(C)
     <span style="color: #a020f0;">use</span>, <span style="color: #a020f0;">intrinsic</span> :: <span style="color: #0000ff;">iso_c_binding</span>
     <span style="color: #228b22;">integer</span> (<span style="color: #008b8b;">c_int64_t</span>), <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span> ::<span style="color: #a0522d;"> context</span>
     <span style="color: #228b22;">integer</span> (<span style="color: #008b8b;">c_int32_t</span>), <span style="color: #a020f0;">intent</span>(in), <span style="color: #a020f0;">value</span> ::<span style="color: #a0522d;"> range</span>
   <span style="color: #a020f0;">end function</span> <span style="color: #0000ff;">qmckl_context_update_range</span>
<span style="color: #a020f0;">end interface</span>
</pre>
</div>

<p>
<code>qmckl_context_set_range</code> returns a copy of the context with a different precision parameter.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_context</span> <span style="color: #0000ff;">qmckl_context_set_range</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">range</span>) {
  <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">new_context</span> = qmckl_context_copy(context);
  <span style="color: #a020f0;">if</span> (new_context == 0) <span style="color: #a020f0;">return</span> 0;

  <span style="color: #a020f0;">if</span> (qmckl_context_update_range(new_context, range) == QMCKL_FAILURE) <span style="color: #a020f0;">return</span> 0;

  <span style="color: #a020f0;">return</span> new_context;
}
</pre>
</div>

<p>
<code>qmckl_context_get_range</code> returns the value of the numerical range in the context.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">int</span> <span style="color: #0000ff;">qmckl_context_get_range</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {
  <span style="color: #a020f0;">if</span> (qmckl_context_check(context) == QMCKL_NULL_CONTEXT) {
      <span style="color: #a020f0;">return</span> qmckl_failwith(context,
                      QMCKL_INVALID_CONTEXT,
                      <span style="color: #8b2252;">"qmckl_context_get_range"</span>,
                      <span style="color: #8b2252;">""</span>);
  }

  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;
  <span style="color: #a020f0;">if</span> (ctx-&gt;fp != <span style="color: #008b8b;">NULL</span>) 
    <span style="color: #a020f0;">return</span> ctx-&gt;fp-&gt;range;
  <span style="color: #a020f0;">else</span>
    <span style="color: #a020f0;">return</span> QMCKL_DEFAULT_RANGE;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org32a66a3" class="outline-3">
<h3 id="org32a66a3"><span class="section-number-3">4.3</span> Helper functions</h3>
<div class="outline-text-3" id="text-4-3">
<p>
<code>qmckl_context_get_epsilon</code> returns \(\epsilon = 2^{1-n}\) where <code>n</code> is the precision.
</p>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">double</span> <span style="color: #0000ff;">qmckl_context_get_epsilon</span>(<span style="color: #a020f0;">const</span> <span style="color: #228b22;">qmckl_context</span> <span style="color: #a0522d;">context</span>) {
  <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">precision</span> = qmckl_context_get_precision(context);
  <span style="color: #a020f0;">return</span> 1. /  (<span style="color: #228b22;">double</span>) (1L &lt;&lt; (precision-1));
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org239a5da" class="outline-2">
<h2 id="org239a5da"><span class="section-number-2">5</span> <span class="todo TODO">TODO</span> Basis set</h2>
<div class="outline-text-2" id="text-5">
<p>
For H<sub>2</sub> with the following basis set,
</p>

<pre class="example">
HYDROGEN
S   5
1         3.387000E+01           6.068000E-03
2         5.095000E+00           4.530800E-02
3         1.159000E+00           2.028220E-01
4         3.258000E-01           5.039030E-01
5         1.027000E-01           3.834210E-01
S   1
1         3.258000E-01           1.000000E+00
S   1
1         1.027000E-01           1.000000E+00
P   1
1         1.407000E+00           1.000000E+00
P   1
1         3.880000E-01           1.000000E+00
D   1
1         1.057000E+00           1.0000000
</pre>

<p>
we have:
</p>

<pre class="example">
type = 'G'
shell_num = 12
prim_num = 20
SHELL_CENTER = [1, 1, 1, 1, 1, 1, 2, 2, 2, 2, 2, 2]
SHELL_ANG_MOM = ['S', 'S', 'S', 'P', 'P', 'D', 'S', 'S', 'S', 'P', 'P', 'D']
SHELL_PRIM_NUM = [5, 1, 1, 1, 1, 1, 5, 1, 1, 1, 1, 1]
prim_index = [1, 6, 7, 8, 9, 10, 11, 16, 17, 18, 19, 20]
EXPONENT = [ 33.87, 5.095, 1.159, 0.3258, 0.1027, 0.3258, 0.1027,
             1.407, 0.388, 1.057, 33.87, 5.095, 1.159, 0.3258, 0.1027,
             0.3258, 0.1027, 1.407, 0.388, 1.057]
COEFFICIENT = [ 0.006068, 0.045308, 0.202822, 0.503903, 0.383421,
                1.0, 1.0, 1.0, 1.0, 1.0, 0.006068, 0.045308, 0.202822,
                0.503903, 0.383421, 1.0, 1.0, 1.0, 1.0, 1.0]
</pre>
</div>
