src/qmckl_context.org
** ~qmckl_context_update_ao_basis~

   Updates the data describing the AO basis set into the context.

   | ~type~                        | Gaussian or Slater                                                   |
   | ~shell_num~                   | Number of shells                                                     |
   | ~prim_num~                    | Total number of primitives                                           |
   | ~SHELL_CENTER(shell_num)~     | Id of the nucleus on which the shell is centered                     |
   | ~SHELL_ANG_MOM(shell_num)~    | Id of the nucleus on which the shell is centered                     |
   | ~SHELL_FACTOR(shell_num)~     | Normalization factor for the shell                                   |
   | ~SHELL_PRIM_NUM(shell_num)~   | Number of primitives in the shell                                    |
   | ~SHELL_PRIM_INDEX(shell_num)~ | Address of the first primitive of the shelll in the ~EXPONENT~ array |
   | ~EXPONENT(prim_num)~          | Array of exponents                                                   |
   | ~COEFFICIENT(prim_num)~       | Array of coefficients                                                |

   #+begin_src c :comments org :tangle (eval h)
qmckl_exit_code
qmckl_context_update_ao_basis(qmckl_context   context         ,
                              const char      type            ,
                              const int64_t   shell_num       ,
                              const int64_t   prim_num        ,
                              const int64_t * SHELL_CENTER    ,
                              const int32_t * SHELL_ANG_MOM   ,
                              const double  * SHELL_FACTOR    ,
                              const int64_t * SHELL_PRIM_NUM  ,
                              const int64_t * SHELL_PRIM_INDEX,
                              const double  * EXPONENT        ,
                              const double  * COEFFICIENT);
   #+end_src

