qmckl_context.html

<div id="outline-container-orgc97bb9b" class="outline-3">
<h3 id="orgc97bb9b"><span class="section-number-3">5.1</span> Data structure</h3>
<div class="outline-text-3" id="text-5-1">
<div class="org-src-container">
<pre class="src src-c" id="orgbf64c08"><span style="color: #a020f0;">typedef</span> <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">qmckl_ao_basis_struct</span> {

  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">shell_num</span>;
  <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">prim_num</span>;
  <span style="color: #228b22;">int64_t</span> * <span style="color: #a0522d;">shell_center</span>;
  <span style="color: #228b22;">int32_t</span> * <span style="color: #a0522d;">shell_ang_mom</span>;
  <span style="color: #228b22;">double</span>  * <span style="color: #a0522d;">shell_factor</span>;
  <span style="color: #228b22;">double</span>  * <span style="color: #a0522d;">exponent</span>    ;
  <span style="color: #228b22;">double</span>  * <span style="color: #a0522d;">coefficient</span> ;
  <span style="color: #228b22;">int64_t</span> * <span style="color: #a0522d;">shell_prim_num</span>;
  <span style="color: #228b22;">char</span>      <span style="color: #a0522d;">type</span>;

} <span style="color: #228b22;">qmckl_ao_basis_struct</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-org185dc35" class="outline-3">
<h3 id="org185dc35"><span class="section-number-3">5.2</span> <code>qmckl_context_update_ao_basis</code></h3>
<div class="outline-text-3" id="text-5-2">
<p>
Updates the data describing the AO basis set into the context.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left"><code>type</code></td>
<td class="org-left">Gaussian or Slater</td>
</tr>

<tr>
<td class="org-left"><code>shell_num</code></td>
<td class="org-left">Number of shells</td>
</tr>

<tr>
<td class="org-left"><code>prim_num</code></td>
<td class="org-left">Total number of primitives</td>
</tr>

<tr>
<td class="org-left"><code>SHELL_CENTER(shell_num)</code></td>
<td class="org-left">Id of the nucleus on which the shell is centered</td>
</tr>

<tr>
<td class="org-left"><code>SHELL_ANG_MOM(shell_num)</code></td>
<td class="org-left">Id of the nucleus on which the shell is centered</td>
</tr>

<tr>
<td class="org-left"><code>SHELL_FACTOR(shell_num)</code></td>
<td class="org-left">Normalization factor for the shell</td>
</tr>

<tr>
<td class="org-left"><code>SHELL_PRIM_NUM(shell_num)</code></td>
<td class="org-left">Number of primitives in the shell</td>
</tr>

<tr>
<td class="org-left"><code>SHELL_PRIM_INDEX(shell_num)</code></td>
<td class="org-left">Address of the first primitive of the shelll in the <code>EXPONENT</code> array</td>
</tr>

<tr>
<td class="org-left"><code>EXPONENT(prim_num)</code></td>
<td class="org-left">Array of exponents</td>
</tr>

<tr>
<td class="org-left"><code>COEFFICIENT(prim_num)</code></td>
<td class="org-left">Array of coefficients</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_context_update_ao_basis</span>(<span style="color: #228b22;">qmckl_context</span>   <span style="color: #a0522d;">context</span>         ,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>      <span style="color: #a0522d;">type</span>            ,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">shell_num</span>       ,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">prim_num</span>        ,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> * <span style="color: #a0522d;">SHELL_CENTER</span>    ,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span> * <span style="color: #a0522d;">SHELL_ANG_MOM</span>   ,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>  * <span style="color: #a0522d;">SHELL_FACTOR</span>    ,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> * <span style="color: #a0522d;">SHELL_PRIM_NUM</span>  ,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> * <span style="color: #a0522d;">SHELL_PRIM_INDEX</span>,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>  * <span style="color: #a0522d;">EXPONENT</span>        ,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>  * <span style="color: #a0522d;">COEFFICIENT</span>);
</pre>
</div>
</div>
