qmckl_context.html

<div id="outline-container-org14dbdd7" class="outline-4">
<h4 id="org14dbdd7"><span class="section-number-4">5.2.1</span> Source</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #228b22;">qmckl_exit_code</span>
<span style="color: #0000ff;">qmckl_context_update_ao_basis</span>(<span style="color: #228b22;">qmckl_context</span>   <span style="color: #a0522d;">context</span>     , <span style="color: #a020f0;">const</span> <span style="color: #228b22;">char</span>      <span style="color: #a0522d;">type</span>,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">shell_num</span>   , <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span>   <span style="color: #a0522d;">prim_num</span>,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> * <span style="color: #a0522d;">SHELL_CENTER</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int32_t</span> * <span style="color: #a0522d;">SHELL_ANG_MOM</span>,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>  * <span style="color: #a0522d;">SHELL_FACTOR</span>, <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> * <span style="color: #a0522d;">SHELL_PRIM_NUM</span>,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int64_t</span> * <span style="color: #a0522d;">SHELL_PRIM_INDEX</span>,
                              <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>  * <span style="color: #a0522d;">EXPONENT</span>    , <span style="color: #a020f0;">const</span> <span style="color: #228b22;">double</span>  * <span style="color: #a0522d;">COEFFICIENT</span>)
{

  <span style="color: #228b22;">int64_t</span> <span style="color: #a0522d;">i</span>;

  /* <span style="color: #b22222;">Check input </span>*/

  <span style="color: #a020f0;">if</span> (type != <span style="color: #8b2252;">'G'</span> &amp;&amp; type != <span style="color: #8b2252;">'S'</span>) <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  <span style="color: #a020f0;">if</span> (shell_num &lt;= 0) <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  <span style="color: #a020f0;">if</span> (prim_num  &lt;= 0) <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  <span style="color: #a020f0;">if</span> (prim_num  &lt; shell_num) <span style="color: #a020f0;">return</span> QMCKL_FAILURE;

  <span style="color: #a020f0;">for</span> (i=0 ; i&lt;shell_num ; i++) {
    <span style="color: #a020f0;">if</span> (SHELL_CENTER[i] &lt;= 0) <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
    <span style="color: #a020f0;">if</span> (SHELL_PRIM_NUM[i] &lt;= 0) <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
    <span style="color: #a020f0;">if</span> (SHELL_ANG_MOM[i] &lt; 0) <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
    <span style="color: #a020f0;">if</span> (SHELL_PRIM_INDEX[i] &lt; 0) <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  }

  <span style="color: #a020f0;">for</span> (i=0 ; i&lt;prim_num ; i++) {
    <span style="color: #a020f0;">if</span> (EXPONENT[i] &lt;= 0) <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  }

  <span style="color: #228b22;">qmckl_context_struct</span>* <span style="color: #a0522d;">ctx</span> = (<span style="color: #228b22;">qmckl_context_struct</span>*) context;
  <span style="color: #a020f0;">if</span> (ctx == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> QMCKL_FAILURE;

  <span style="color: #228b22;">qmckl_ao_basis_struct</span>* <span style="color: #a0522d;">basis</span> =
    (<span style="color: #228b22;">qmckl_ao_basis_struct</span>*) <span style="color: #0000ff;">qmckl_malloc</span> (context, <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">qmckl_ao_basis_struct</span>));
  <span style="color: #a020f0;">if</span> (basis == <span style="color: #008b8b;">NULL</span>) <span style="color: #a020f0;">return</span> QMCKL_ALLOCATION_FAILED;


  /* <span style="color: #b22222;">Memory allocations </span>*/

  assert (basis-&gt;shell_center == <span style="color: #008b8b;">NULL</span>);
  basis-&gt;shell_center  = (<span style="color: #228b22;">int64_t</span>*) qmckl_malloc (context, <span style="color: #228b22;">shell_num</span> * <span style="color: #a020f0;">sizeof</span>(int64_t));
  <span style="color: #a020f0;">if</span> (basis-&gt;shell_center == <span style="color: #008b8b;">NULL</span>) {
    qmckl_free(context, basis);
    basis = <span style="color: #008b8b;">NULL</span>;
    <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  }

  assert (basis-&gt;shell_ang_mom == <span style="color: #008b8b;">NULL</span>);
  basis-&gt;shell_ang_mom = (<span style="color: #228b22;">int32_t</span>*) qmckl_malloc (context, <span style="color: #228b22;">shell_num</span> * <span style="color: #a020f0;">sizeof</span>(int32_t));
  <span style="color: #a020f0;">if</span> (basis-&gt;shell_ang_mom == <span style="color: #008b8b;">NULL</span>) {
    qmckl_free(context, basis-&gt;shell_center);
    basis-&gt;shell_center = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis);
    basis = <span style="color: #008b8b;">NULL</span>;
    <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  }

  assert (basis-&gt;shell_prim_num == <span style="color: #008b8b;">NULL</span>);
  basis-&gt;shell_prim_num= (<span style="color: #228b22;">int64_t</span>*) qmckl_malloc (context, <span style="color: #228b22;">shell_num</span> * <span style="color: #a020f0;">sizeof</span>(int64_t));
  <span style="color: #a020f0;">if</span> (basis-&gt;shell_prim_num == <span style="color: #008b8b;">NULL</span>) {
    qmckl_free(context, basis-&gt;shell_ang_mom);
    basis-&gt;shell_ang_mom = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis-&gt;shell_center);
    basis-&gt;shell_center = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis);
    basis = <span style="color: #008b8b;">NULL</span>;
    <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  }

  assert (basis-&gt;shell_factor == <span style="color: #008b8b;">NULL</span>);
  basis-&gt;shell_factor  = (<span style="color: #228b22;">double</span> *) qmckl_malloc (context, <span style="color: #228b22;">shell_num</span> * <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>));
  <span style="color: #a020f0;">if</span> (basis-&gt;shell_factor == <span style="color: #008b8b;">NULL</span>) {
    qmckl_free(context, basis-&gt;shell_prim_num);
    basis-&gt;shell_prim_num = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis-&gt;shell_ang_mom);
    basis-&gt;shell_ang_mom = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis-&gt;shell_center);
    basis-&gt;shell_center = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis);
    basis = <span style="color: #008b8b;">NULL</span>;
    <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  }

  assert (basis-&gt;exponent == <span style="color: #008b8b;">NULL</span>);
  basis-&gt;exponent      = (<span style="color: #228b22;">double</span> *) qmckl_malloc (context, <span style="color: #228b22;">prim_num</span> * <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>));
  <span style="color: #a020f0;">if</span> (basis-&gt;exponent == <span style="color: #008b8b;">NULL</span>) {
    qmckl_free(context, basis-&gt;shell_factor);
    basis-&gt;shell_factor = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis-&gt;shell_prim_num);
    basis-&gt;shell_prim_num = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis-&gt;shell_ang_mom);
    basis-&gt;shell_ang_mom = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis-&gt;shell_center);
    basis-&gt;shell_center = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis);
    basis = <span style="color: #008b8b;">NULL</span>;
    <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  }

  assert (basis-&gt;coefficient == <span style="color: #008b8b;">NULL</span>);
  basis-&gt;coefficient   = (<span style="color: #228b22;">double</span> *) qmckl_malloc (context, <span style="color: #228b22;">prim_num</span> * <span style="color: #a020f0;">sizeof</span>(<span style="color: #228b22;">double</span>));
  <span style="color: #a020f0;">if</span> (basis-&gt;coefficient == <span style="color: #008b8b;">NULL</span>) {
    qmckl_free(context, basis-&gt;exponent);
    basis-&gt;exponent = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis-&gt;shell_factor);
    basis-&gt;shell_factor = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis-&gt;shell_prim_num);
    basis-&gt;shell_prim_num = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis-&gt;shell_ang_mom);
    basis-&gt;shell_ang_mom = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis-&gt;shell_center);
    basis-&gt;shell_center = <span style="color: #008b8b;">NULL</span>;
    qmckl_free(context, basis);
    basis = <span style="color: #008b8b;">NULL</span>;
    <span style="color: #a020f0;">return</span> QMCKL_FAILURE;
  }


  /* <span style="color: #b22222;">Assign data </span>*/

  basis-&gt;type      = type;
  basis-&gt;shell_num = shell_num;
  basis-&gt;prim_num  = prim_num;

  <span style="color: #a020f0;">for</span> (i=0 ; i&lt;shell_num ; i++) {
    basis-&gt;shell_center  [i] = SHELL_CENTER  [i];
    basis-&gt;shell_ang_mom [i] = SHELL_ANG_MOM [i];
    basis-&gt;shell_prim_num[i] = SHELL_PRIM_NUM[i];
    basis-&gt;shell_factor  [i] = SHELL_FACTOR  [i];
  }

  <span style="color: #a020f0;">for</span> (i=0 ; i&lt;prim_num ; i++) {
    basis-&gt;exponent   [i] = EXPONENT[i];
    basis-&gt;coefficient[i] = COEFFICIENT[i];
  }

  ctx-&gt;ao_basis = basis;
  <span style="color: #a020f0;">return</span> QMCKL_SUCCESS;
}
</pre>
</div>
</div>
</div>
